using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Prophecy.Data
{
    partial class ChaodaiInfo
    {
        public static List<ChaodaiItem> ItemKR = new List<ChaodaiItem>
        {
            // 高句丽部分起讫年不确切，来自wiki，考据源来自碑文推理
            new ("永乐", 391, 22, "高句丽", "好太王", "高安"),
            new ("延寿", 451, 1, "高句丽", "长寿王", "高琏"),
            new ("建兴", 472, 5, "高句丽", "长寿王", "高琏"),
            new ("延嘉", 533, 7, "高句丽", "安原王", "高延"),
            new ("太和", 544, 3, "高句丽", "安原王", "高延"),
            new ("景□", 568, 4, "高句丽", "平原王", "高阳"),
            // 没具体年份的：永康  □熙
            
            new ("建元", 536, 4, "新罗", "法兴王", "金原宗"),
            new ("建元", 540, 11, "新罗", "真兴王", "金彡麦宗",true,536),
            new ("开国", 551, 17, "新罗", "真兴王", "金彡麦宗"),
            new ("大昌", 568, 4, "新罗", "真兴王", "金彡麦宗"),
            new ("鸿济", 572, 4, "新罗", "真兴王", "金彡麦宗"),
            new ("鸿济", 576, 3, "新罗", "真智王", "金舍轮",true,572),
            new ("鸿济", 579, 5, "新罗", "真平王", "金伯净",true,572),
            new ("建福", 584, 48, "新罗", "真平王", "金伯净"),
            new ("建福", 632, 2, "新罗", "善德女王", "金德曼",true,584),
            new ("仁平", 634, 13, "新罗", "善德女王", "金德曼"),
            new ("仁平", 647, 0.07, "新罗", "真德女王", "金胜曼",true,634),
            new ("太和", 647.07, 3, "新罗", "真德女王", "金胜曼"),

            new ("庆云", 822, 1, "长安国", "", "金宪昌"),
            new ("正开", 901, 36, "后-百济", "", "甄萱/甄神剑"),
            new ("武泰", 904, 1, "后-高句丽-摩震", "", "弓裔"),
            new ("圣册", 905, 6, "后-高句丽-摩震", "", "弓裔"),
            new ("永德万岁", 911, 3, "后-高句丽-泰封", "", "弓裔"),
            new ("政开", 914, 4.06, "后-高句丽-泰封", "", "弓裔"),
            new ("天授", 918.06, 15.03, "高丽", "太祖", "王建"),
            new ("光德", 950, 1.12, "高丽", "光宗", "王昭"),
            new ("峻丰", 960, 3.12, "高丽", "光宗", "王昭"),
            new ("天开", 1135, 2, "高丽-大为国", "", "妙清"),
            new ("开国", 1894, 2, "大朝鲜国", "", "",false,1392),
            new ("建阳", 1896, 1.09, "大朝鲜国", "高宗", "李㷩",false),
            new ("光武", 1897.08, 10.08, "大韩帝国", "高宗", "李㷩",false),
            new ("隆熙", 1907.08, 3.09, "大韩帝国", "纯宗", "李坧",false),
            new ("檀纪", 1945, 18, "大韩民国", "", "",false,-2332),
            new("主体", 1945, 28, "朝鲜", "", "",false, 1912),  // 1997开始才使用，方便查询所以定为1945开始显示。2024.10疑似停用
        };
    }
}
