using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Prophecy.Data
{
    /// <summary>
    /// 时区
    /// </summary>
    public class TimeZoneItem
    {
        public string Name;
        public string Name2;
        public double Time;


        /// <summary>
        /// 日照信息的压缩字段
        /// 格式为10位字符串：MMnWXMMnWX  
        /// 前五位是夏令时开始，后五位是夏令时结束。
        /// 其中MM表示月份，n表示周，W表示星期，X表示小时部分偏移量（a = 0，b = 1，...，x = 23）
        /// 例如：0350d1050d 表示这一时区的夏令时从3月第五个星期日3点开始，到10月第五个星期日3点结束
        /// </summary>
        public string Daylight;

        public TimeZoneItem(string _name, string _name2, double time, string daylightStr)
        {
            Name = _name.Trim();
            Name2 = _name2.Trim();
            Time = time;
            Daylight = daylightStr;
        }
    }
    public class TimeZones
    {

        /// <summary>
        /// 根据名称获得时区
        /// </summary>
        /// <param name="name"></param>
        /// <returns></returns>
        public static TimeZoneItem FindTimeZone(string name)
        {
            if (string.IsNullOrWhiteSpace(name)) return null;
            name = name.Trim();
            var res = TimeZoneList.Where(c => c.Name == name || c.Name2 == name).FirstOrDefault();
            return res;
        }

        



        /// <summary>
        /// 时区表
        /// </summary>
        public static readonly List<TimeZoneItem> TimeZoneList = new List<TimeZoneItem>
        {
            new ("中国","北京、乌鲁木齐、台北、港澳",8,"0"),
            new ("阿富汗","喀布尔",4.5,"0"),
            new ("阿联酋","阿布扎比",4,"0"),
            new ("阿曼","马斯喀特",4,"0"),
            new ("阿塞拜疆","巴库",4,"0"),
            new ("巴基斯坦","卡拉奇、伊斯兰堡",5,"0"),
            new ("巴勒斯坦","耶路撒冷、加沙、杰里科",2,"0415d0915d"),
            new ("巴林","麦纳麦",3,"0"),
            new ("不丹","廷布",6,"0"),
            new ("朝鲜","平壤",9,"0"),
            new ("东帝汶","帝力",8,"0"),
            new ("俄罗斯东五区","鄂木斯克",5,"0350d1050d"),
            new ("俄罗斯东八区","雅库茨克",8,"0350d1050d"),
            new ("俄罗斯东九区","海参崴",9,"0350d1050d"),
            new ("俄罗斯东六区","新西伯利亚",6,"0350d1050d"),
            new ("俄罗斯东七区","伊尔库茨克",7,"0350d1050d"),
            new ("俄罗斯东十区","马加丹",10,"0350d1050d"),
            new ("俄罗斯东十一区","阿纳德尔",11,"0350d1050d"),
            new ("菲律宾","马尼拉",8,"0415d1015d"),
            new ("格鲁吉亚","第比利斯",5,"0"),
            new ("哈萨克斯坦东部","阿拉木图、卡拉干达",5,"0"),
            new ("哈萨克斯坦西部","阿克纠宾斯克",4,"0"),
            new ("韩国","汉城",9,"0"),
            new ("吉尔吉斯斯坦","比什凯克",5,"0"),
            new ("柬埔寨","金边",7,"0"),
            new ("卡塔尔","多哈",3,"0"),
            new ("科威特","科威特市",3,"0"),
            new ("老挝","万象",7,"0"),
            new ("黎巴嫩","贝鲁特",2,"0350d1050d"),
            new ("马尔代夫","马累",5,"0"),
            new ("马来西亚","吉隆坡",8,"0"),
            new ("蒙古","乌兰巴托",8,"0350d0950d"),
            new ("孟加拉国","达卡",6,"0"),
            new ("缅甸","仰光",6.5,"0"),
            new ("尼泊尔","加德满都",5.75,"0"),
            new ("日本","东京、大阪、札幌",9,"0"),
            new ("塞浦路斯","尼科西亚",2,"0"),
            new ("沙特阿拉伯","利雅得",3,"0"),
            new ("斯里兰卡","科伦坡",5.5,"0"),
            new ("塔吉克斯坦","杜尚别",5,"0"),
            new ("泰国","曼谷",7,"0"),
            new ("土耳其","伊斯坦布尔",2,"0"),
            new ("土库曼斯坦","阿什哈巴德",5,"0"),
            new ("文莱","斯里巴加湾",8,"0"),
            new ("乌兹别克斯坦","塔什干",5,"0"),
            new ("锡金","甘托克",5.5,"0"),
            new ("新加坡","新加坡",8,"0"),
            new ("叙利亚","大马士革",2,"0411d1011d"),
            new ("亚美尼亚","埃里温",4,"0"),
            new ("也门","萨那",3,"0"),
            new ("伊拉克","巴格达",3,"0411d1011d"),
            new ("伊朗","德黑兰",3.5,"0411d1011d"),
            new ("以色列","特拉维夫、耶路撒冷",2,"0415d0915d"),
            new ("印度","新德里、孟买、加尔各答",5.5,"0"),
            new ("印度尼西亚","雅加达",7,"0"),
            new ("约旦","安曼",2,"0"),
            new ("越南","河内",7,"0"),
            new ("阿尔巴尼亚","地拉那",1,"0"),
            new ("爱尔兰","都柏林",0,"0350b1050b"),
            new ("爱沙尼亚","塔林",2,"0"),
            new ("安道尔","安道尔城",0,"0"),
            new ("奥地利","维也纳",1,"0350b1050b"),
            new ("白俄罗斯","明斯克",2,"0350d1050d"),
            new ("保加利亚","索非亚",2,"0"),
            new ("比利时","布鲁塞尔",1,"0350b1050b"),
            new ("冰岛","雷克雅未克",0,"0"),
            new ("波黑","萨拉热窝",1,"0"),
            new ("波兰","华沙",1,"0"),
            new ("丹麦","哥本哈根",1,"0410d1050d"),
            new ("德国","柏林",1,"0350b1050b"),
            new ("俄罗斯东二区","莫斯科",2,"0350d1050d"),
            new ("俄罗斯东三区","伏尔加格勒",3,"0350d1050d"),
            new ("俄罗斯东四区","叶卡捷琳堡",4,"0350d1050d"),
            new ("法国","巴黎",1,"0350b1050b"),
            new ("梵蒂冈","梵蒂冈",1,"0"),
            new ("芬兰","赫尔辛基",2,"0350b1050b"),
            new ("荷兰","阿姆斯特丹",1,"0350b1050b"),
            new ("捷克","布拉格",1,"0"),
            new ("克罗地亚","萨格勒布",1,"0"),
            new ("拉脱维亚","里加",2,"0"),
            new ("立陶宛","维尔纽斯",2,"0"),
            new ("列支敦士登","瓦杜兹",1,"0"),
            new ("卢森堡","卢森堡市",1,"0350b1050b"),
            new ("罗马尼亚","布加勒斯特",2,"0"),
            new ("马耳他","瓦莱塔",1,"0"),
            new ("马其顿","斯科普里",1,"0"),
            new ("摩尔多瓦","基什尼奥夫",2,"0"),
            new ("摩纳哥","摩纳哥市",1,"0"),
            new ("挪威","奥斯陆",1,"0"),
            new ("葡萄牙","里斯本",0,"0350b1050b"),
            new ("瑞典","斯德哥尔摩",1,"0350b1050b"),
            new ("瑞士","苏黎世",1,"0"),
            new ("塞尔维亚和黑山","贝尔格莱德",1,"0"),
            new ("圣马力诺","圣马力诺",1,"0"),
            new ("斯洛伐克","布拉迪斯拉发",1,"0"),
            new ("斯洛文尼亚","卢布尔雅那",1,"0"),
            new ("乌克兰东部","辛菲罗波尔",3,"0"),
            new ("乌克兰西部","基辅",2,"0"),
            new ("西班牙","马德里",1,"0350b1050b"),
            new ("希腊","雅典",2,"0350b1050b"),
            new ("匈牙利","布达佩斯",1,"0"),
            new ("意大利","罗马",1,"0350b1050b"),
            new ("英国","伦敦、爱丁堡",0,"0350b1050b"),
            new ("格陵兰(丹)","努克(戈特霍布)",-3,"0"),
            new ("加拿大大西洋时区","哈利法克斯",-4,"0410c1050c"),
            new ("加拿大东部时区","渥太华、蒙特利尔",-5,"0410c1050c"),
            new ("加拿大纽芬兰时区","纽芬兰、圣约翰斯",-3.5,"0410c1050c"),
            new ("加拿大山区时区","艾伯塔",-7,"0410c1050c"),
            new ("加拿大太平洋时区","温哥华",-8,"0410c1050c"),
            new ("加拿大中央时区","温尼伯",-6,"0410c1050c"),
            new ("美国阿拉斯加","朱诺、费尔班克斯",-9,"0"),
            new ("美国东部","纽约",-5,"0410c1050c"),
            new ("美国山区","丹佛",-7,"0410c1050c"),
            new ("美国西岸","旧金山、洛杉矶",-8,"0410c1050c"),
            new ("美国中部","芝加哥",-6,"0410c1050c"),
            new ("阿根廷","布宜诺斯艾利斯",-3,"0"),
            new ("阿鲁巴岛(荷)","奥拉涅斯塔德",-4,"0"),
            new ("安提瓜和巴布达","圣约翰",-4,"0"),
            new ("巴巴多斯","布里奇敦",-4,"0"),
            new ("巴哈马","拿骚",-5,"0"),
            new ("巴拉圭","亚松森",-3,"1010d0250d"),
            new ("巴拿马","巴拿马市",-5,"0"),
            new ("巴西东部","里约热内卢、巴西利亚",-3,"1010d0250d"),
            new ("巴西诺罗纳岛","诺罗纳岛",-2,"1010d0250d"),
            new ("巴西西部","阿克里州、亚马孙州",-5,"1010d0250d"),
            new ("巴西中部","库亚巴",-4,"1010d0250d"),
            new ("百慕大群岛(英)","哈密尔顿",-4,"0"),
            new ("波多黎各(美)","圣胡安",-4,"0"),
            new ("玻利维亚","拉巴斯",-4,"0"),
            new ("伯利兹","贝尔莫潘",-6,"0"),
            new ("多米尼加共和国","圣多明各",-4,"0"),
            new ("多米尼克国","罗索",-4,"0"),
            new ("厄瓜多尔","基多",-5,"0"),
            new ("法属圭亚那","卡宴",-3,"0"),
            new ("哥伦比亚","波哥大",-5,"0"),
            new ("哥斯达黎加","圣何塞",-6,"0"),
            new ("格林纳达","圣乔治",-4,"0"),
            new ("古巴","哈瓦那",-5,"0411d1050d"),
            new ("瓜德罗普岛(法)","巴斯特尔",-4,"0"),
            new ("圭亚那","乔治敦",-3,"0"),
            new ("海地","太子港",-5,"0"),
            new ("荷属安的列斯群岛","威廉斯塔德",-4,"0"),
            new ("洪都拉斯","特古西加尔巴",-6,"0"),
            new ("开曼群岛(英)","乔治敦",-5,"0"),
            new ("马尔维纳斯(福克兰)群岛","斯坦利港",-3,"0910d0410d"),
            new ("马提尼克岛(法)","法兰西堡",-4,"0"),
            new ("美属维尔京群岛","夏洛特阿马利亚",-4,"0"),
            new ("秘鲁","利马",-5,"0"),
            new ("墨西哥东部","墨西哥城",-6,"0"),
            new ("墨西哥西部","蒂华纳",-8,"0"),
            new ("墨西哥中部","马萨特兰",-7,"0"),
            new ("尼加拉瓜","马拉瓜",-5,"0"),
            new ("萨尔瓦多","圣萨尔瓦多",-6,"0"),
            new ("圣基茨和尼维斯","巴斯特尔",-4,"0"),
            new ("圣卢西亚","卡斯特里",-4,"0"),
            new ("圣文森特和格林纳丁斯","金斯敦",-4,"0"),
            new ("苏里南","帕拉马里博",-3,"0"),
            new ("特立尼达和多巴哥","西班牙港",-4,"0"),
            new ("危地马拉","危地马拉城",-6,"0"),
            new ("委内瑞拉","加拉加斯",-4,"0"),
            new ("乌拉圭","蒙得维的亚",-3,"0"),
            new ("牙买加","金斯敦",-5,"0"),
            new ("英属维尔京群岛","罗德城",-4,"0"),
            new ("智利","圣地亚哥",-4,"1010d0310d"),
            new ("智利帕斯库阿岛","汉加罗亚",-5,"1010d0310d"),
            new ("阿尔及利亚","阿尔及尔",1,"0"),
            new ("埃及","开罗",2,"0455d0954d"),
            new ("埃塞俄比亚","亚的斯亚贝巴",3,"0"),
            new ("安哥拉","罗安达",1,"0"),
            new ("贝宁","波多诺伏",1,"0"),
            new ("博茨瓦纳","哈博罗内",2,"0"),
            new ("布基纳法索","瓦加杜古",0,"0"),
            new ("布隆迪","布琼布拉",2,"0"),
            new ("赤道几内亚","马拉博",1,"0"),
            new ("多哥","洛美",0,"0"),
            new ("厄立特里亚","阿斯马拉",3,"0"),
            new ("佛得角","普拉亚",-1,"0"),
            new ("冈比亚","班珠尔",0,"0"),
            new ("刚果","布拉柴维尔",1,"0"),
            new ("刚果(金)","金沙萨",1,"0"),
            new ("吉布提","吉布提市",3,"0"),
            new ("几内亚","科纳克里",0,"0"),
            new ("几内亚比绍","比绍",0,"0"),
            new ("加纳","阿克拉",0,"0"),
            new ("加蓬","利伯维尔",1,"0"),
            new ("津巴布韦","哈拉雷",2,"0"),
            new ("喀麦隆","雅温德",1,"0"),
            new ("科摩罗","莫罗尼",3,"0"),
            new ("科特迪瓦","亚穆苏克罗",0,"0"),
            new ("肯尼亚","内罗毕",3,"0"),
            new ("莱索托","马赛卢",2,"0"),
            new ("利比里亚","蒙罗维亚",0,"0"),
            new ("利比亚","的黎波里",2,"0"),
            new ("卢旺达","基加利",2,"0"),
            new ("马达加斯加","塔那那利佛",3,"0"),
            new ("马拉维","利隆圭",2,"0"),
            new ("马里","巴马科",0,"0"),
            new ("毛里求斯","路易港",4,"0"),
            new ("毛里塔尼亚","努瓦克肖特",0,"0"),
            new ("摩洛哥","拉巴特",0,"0"),
            new ("莫桑比克","马普托",2,"0"),
            new ("纳米比亚","温得和克",2,"0910d0410d"),
            new ("南非","比勒陀利亚、约翰内斯堡",2,"0"),
            new ("尼日尔","尼亚美",1,"0"),
            new ("尼日利亚","阿布贾、拉各斯",1,"0"),
            new ("塞拉利昂","弗里敦",0,"0"),
            new ("塞内加尔","达喀尔",0,"0"),
            new ("塞舌尔","维多利亚",4,"0"),
            new ("圣多美和普林西比","圣多美",0,"0"),
            new ("斯威士兰","姆巴巴内",2,"0"),
            new ("苏丹","喀土穆",2,"0"),
            new ("索马里","摩加迪沙",3,"0"),
            new ("坦桑尼亚","达累斯萨拉姆",3,"0"),
            new ("突尼斯","突尼斯",1,"0"),
            new ("乌干达","坎帕拉",3,"0"),
            new ("西撒哈拉","阿尤恩",0,"0"),
            new ("赞比亚","卢萨卡",2,"0"),
            new ("乍得","恩贾梅纳",1,"0"),
            new ("中非共和国","班吉",1,"0"),
            new ("埃尼威托克岛","埃尼威托克岛",-12,"0"),
            new ("澳大利亚东部","堪培拉、悉尼、布里斯班",10,"1050d0350d"),
            new ("澳大利亚西部","珀斯",8,"1050d0350d"),
            new ("澳大利亚中部","阿德莱德、达尔文",9.5,"1050d0350d"),
            new ("巴布亚新几内亚","莫尔兹比港",10,"0"),
            new ("北马里亚纳群岛(美)","塞班",10,"0"),
            new ("法属波利尼西亚","帕皮提",-10,"0"),
            new ("斐济","苏瓦",12,"1110d0250d"),
            new ("关岛(美)","阿加尼亚",10,"0"),
            new ("基里巴斯","塔拉瓦",12,"0"),
            new ("库克群岛(新)","阿瓦鲁阿",-10.5,"0"),
            new ("马里亚纳群岛","塞班岛",10,"0"),
            new ("马绍尔群岛","马朱罗",12,"0"),
            new ("美属萨摩亚","帕果帕果",-11,"0"),
            new ("密克罗尼西亚","帕利基尔",10,"0"),
            new ("瑙鲁共和国","亚伦",12,"0"),
            new ("所罗门群岛","霍尼亚拉",11,"0"),
            new ("汤加","努库阿洛法",13,"1016d0416d"),
            new ("图瓦卢","富纳富提",12,"0"),
            new ("瓦努阿图","维拉港",11,"0"),
            new ("西萨摩亚","阿皮亚",-11,"0"),
            new ("夏威夷(美)","檀香山",-10,"0"),
            new ("新喀里多尼亚(法)","努美阿",11,"0"),
            new ("新西兰","奥克兰、惠灵顿",12,"1010d0416d"),
            new ("新西兰查塔姆群岛","查塔姆群岛",12.75,"1010d0416d"),
            new ("中途岛(美)","中途岛",-11,"0"),
            new ("国际日期变更线（东）","国际日期变更线（东）",-12,"0"),
            new ("国际日期变更线（西）","国际日期变更线（西）",12,"0"),

        };



    }
}
